// ヒント、選択肢、解答の配列準備

// シルエット
PImage[] ken = new PImage[47];

// ヒント１
PImage[] h1 = new PImage[47];

// ヒント２ 
String[] h2 = 
  {"じゃがいも美味しい！", "リンゴが美味しい！", "わんこそばが有名！", "牛タンが美味しい！", 
  "きりたんぽが有名！", "さくらんぼ美味しい！", "きたかたラーメン！！", 
  "水戸納豆が有名！", "ぎょうざが美味しい！", "下仁田ネギが有名！", "草加せんべい美味しい！", 
  "白菜が有名！", "スカイツリーがあるよ！", "かまぼこが有名！", 
  "コシヒカリが美味しい！", "白エビ美味しい！", "甘エビ美味しい！", "越前カニが有名！", "ぶどうが美味しい！", 
  "信州そばが有名！", "あゆが美味しい！", "お茶が美味しい！", "ういろうが有名！", 
  "イセエビ美味しい！", "びわ湖あるよ！", "八つ橋が美味しい！", "たこ焼き美味しい！", "バウムクーヘン有名！", 
  "大仏あるよ！", "みかんが美味しい！", 
  "砂丘があるよ！", "出雲大社があるよ！", "きびだんごが有名！", "もみじまんじゅうが有名！", 
  "ふぐが美味しい！", "すだちが美味しい！", "うどんが有名！", "みかんが美味しい！", "なすが有名！",
"博多ラーメン美味しい！","玉ねぎが有名！","ちゃんぽんが有名！","スイカが美味しい！","かぼすが有名！",
"マンゴーが美味しい！","黒豚が有名！","ゴーヤが美味しい！"};

String[] S1 = {"ほっかいどう", "かながわけん", "さいたまけん"}; // 北海道の選択肢
String[] S2 = {"しがけん", "かごしまけん", "あおもりけん"}; // 青森の選択肢
String[] S3 = {"とうきょうと", "いわてけん", "ちばけん"}; // 岩手の選択肢
String[] S4 = {"みやぎけん", "しまねけん", "いしかわけん"}; // 宮城の選択肢
String[] S5 = {"あいちけん", "あきたけん", "やまがたけん"}; // 秋田の選択肢
String[] S6 = {"きょうとふ", "やまがたけん", "にいがたけん"}; // 山形の選択肢
String[] S7 = {"おおいたけん", "ぎふけん", "ふくしまけん"}; // 福島の選択肢

String[] S8 = {"とやまけん", "いばらきけん", "みやぎけん"}; // 茨城の選択肢
String[] S9 = {"とちぎけん", "こうちけん", "やまなしけん"}; // 栃木の選択肢
String[] S10 = {"ぐんまけん", "いわてけん", "ながのけん"}; // 群馬の選択肢
String[] S11 = {"かがわけん", "しまねけん", "さいたまけん"}; // 埼玉の選択肢
String[] S12 = {"くまもとけん", "ちばけん", "いしかわけん"}; // 千葉の選択肢
String[] S13 = {"とうきょうと", "とくしまけん", "さがけん"}; // 東京の選択肢
String[] S14 = {"しまねけん", "あいちけん", "かながわけん"}; // 神奈川の選択肢

String[] S15 = {"にいがたけん", "いしかわけん", "とっとりけん"}; // 新潟の選択肢
String[] S16 = {"ぐんまけん", "とやまけん", "しまねけん"}; // 富山の選択肢
String[] S17 = {"いしかわけん", "おきなわけん", "ながさきけん"}; // 石川の選択肢
String[] S18 = {"ふくおかけん", "みやざきけん", "ふくいけん"}; // 福井の選択肢
String[] S19 = {"みやざきけん", "やまなしけん", "おかやまけん"}; // 山梨の選択肢
String[] S20 = {"ながのけん", "えひめけん", "ひろしまけん"}; // 長野の選択肢
String[] S21 = {"しがけん", "ぎふけん", "やまがたけん"}; // 岐阜の選択肢
String[] S22 = {"こうちけん", "しずおかけん", "みえけん"}; // 静岡の選択肢
String[] S23 = {"しまねけん", "あいちけん", "かながわけん"}; // 愛知の選択肢

String[] S24 = {"あきたけん", "にいがたけん", "みえけん"}; // 三重の選択肢
String[] S25 = {"しがけん", "ならけん", "ふくしまけん"}; // 滋賀の選択肢
String[] S26 = {"きょうとふ", "おおさかふ", "とうきょうと"}; // 京都の選択肢
String[] S27 = {"やまぐちけん", "いばらきけん", "おおさかふ"}; // 大阪の選択肢
String[] S28 = {"ひょうごけん", "ながのけん", "ぎふけん"}; // 兵庫の選択肢
String[] S29 = {"やまがたけん", "ならけん", "とちぎけん"}; // 奈良の選択肢
String[] S30 = {"いわてけん", "わかやまけん", "かながわけん"}; // 和歌山の選択肢

String[] S31 = {"しまねけん", "いしかわけん", "とっとりけん"}; // 鳥取の選択肢
String[] S32 = {"しまねけん", "とやまけん", "とっとりけん"}; // 島根の選択肢
String[] S33 = {"ぐんまけん", "おかやまけん", "とちぎけん"}; // 岡山の選択肢
String[] S34 = {"ひろしまけん", "おかやまけん", "ふくおかけん"}; // 広島の選択肢
String[] S35 = {"わかやまけん", "とやまけん", "やまぐちけん"}; // 山口の選択肢
String[] S36 = {"とくしまけん", "とうきょうと", "さいたまけん"}; // 徳島の選択肢
String[] S37 = {"おおさかふ", "かがわけん", "かながわけん"}; // 香川の選択肢
String[] S38 = {"いわてけん", "みえけん", "えひめけん"}; // 愛媛の選択肢
String[] S39 = {"あおもりけん", "おおいたけん", "こうちけん"}; // 高知の選択肢

String[] S40 = {"おかやまけん", "ふくおかけん", "さがけん"}; // 福岡の選択肢
String[] S41 = {"さがけん", "ふくおかけん", "ながさきけん"}; // 佐賀の選択肢
String[] S42 = {"みやざきけん", "ながのけん", "ながさきけん"}; // 長崎の選択肢
String[] S43 = {"やまがたけん", "くまもとけん", "にいがたけん"}; // 熊本の選択肢
String[] S44 = {"おおいたけん", "いしかわけん", "ひろしまけん"}; // 大分の選択肢
String[] S45 = {"ながさきけん", "みやぎけん", "みやざきけん"}; // 宮崎の選択肢
String[] S46 = {"かごしまけん", "あおもりけん", "こうちけん"}; // 鹿児島の選択肢
String[] S47 = {"おおさかふ", "ならけん", "おきなわけん"}; // 沖縄の選択肢

//scene2について選択肢
String[] SL1 = {"さっぽろ", "ぎふ", "おかやま"}; // 北海道の選択肢
String[] SL2 = {"あおもり", "おおつ", "とやま"}; // 青森の選択肢
String[] SL3 = {"あきた", "ながの", "もりおか"}; // 岩手の選択肢
String[] SL4 = {"みやざき", "せんだい", "にいがた"}; // 宮城の選択肢
String[] SL5 = {"あきた", "かなざわ", "よこはま"}; // 秋田の選択肢
String[] SL6 = {"とうきょう", "やまがた", "こうふ"}; // 山形の選択肢
String[] SL7 = {"たかまつ", "さいたま", "ふくしま"}; // 福島の選択肢

String[] SL8 = {"みと", "しずおか", "ひろしま"}; // 茨城の選択肢
String[] SL9 = {"わかやま", "うつのみや", "おおいた"}; // 栃木の選択肢
String[] SL10 = {"さが", "ふくい", "まえばし"}; // 群馬の選択肢
String[] SL11 = {"まつやま", "とっとり", "さいたま"}; // 埼玉の選択肢
String[] SL12 = {"ちば", "くまもと", "さっぽろ"}; // 千葉の選択肢
String[] SL13 = {"とうきょう", "つ", "なごや"}; // 東京の選択肢
String[] SL14 = {"やまぐち", "よこはま", "ふくおか"}; // 神奈川の選択肢

String[] SL15 = {"にいがた", "つ", "かなざわ"}; // 新潟の選択肢
String[] SL16 = {"にいがた", "とやま", "ふくい"}; // 富山の選択肢
String[] SL17 = {"かなざわ", "あおもり", "ながさき"}; // 石川の選択肢
String[] SL18 = {"かごしま", "こうべ", "ふくい"}; // 福井の選択肢
String[] SL19 = {"こうふ", "とくしま", "とちぎ"}; // 山梨の選択肢
String[] SL20 = {"ながの", "ぎふ", "ちば"}; // 長野の選択肢
String[] SL21 = {"おおさか", "ぎふ", "さっぽろ"}; // 岐阜の選択肢
String[] SL22 = {"せんだい", "しずおか", "わかやま"}; // 静岡の選択肢
String[] SL23 = {"なごや", "みと", "こうち"}; // 愛知の選択肢

String[] SL24 = {"あきた", "おおつ", "つ"}; // 三重の選択肢
String[] SL25 = {"おおつ", "なら", "かごしま"}; // 滋賀の選択肢
String[] SL26 = {"きょうと", "うつのみや", "とうきょう"}; // 京都の選択肢
String[] SL27 = {"とやま", "ひろしま", "おおさか"}; // 大阪の選択肢
String[] SL28 = {"こうべ", "ながの", "おかやま"}; // 兵庫の選択肢
String[] SL29 = {"なら", "もちおか", "なは"}; // 奈良の選択肢
String[] SL30 = {"ふくしま", "わかやま", "まえばし"}; // 和歌山の選択肢

String[] SL31 = {"まつえ", "ふくい", "とっとり"}; // 鳥取の選択肢
String[] SL32 = {"まつやま", "まつえ", "とくしま"}; // 島根の選択肢
String[] SL33 = {"おかやま", "くまもと", "ひろしま"}; // 岡山の選択肢
String[] SL34 = {"ひろしま", "ふくおか", "こうべ"}; // 広島の選択肢
String[] SL35 = {"わかやま", "あきた", "やまぐち"}; // 山口の選択肢
String[] SL36 = {"ふくしま", "とくしま", "さいたま"}; // 徳島の選択肢
String[] SL37 = {"やまがた", "たかまつ", "きょうと"}; // 香川の選択肢
String[] SL38 = {"まつやま", "にいがた", "なごや"}; // 愛媛の選択肢
String[] SL39 = {"こうち", "おおいた", "なは"}; // 高知の選択肢

String[] SL40 = {"おかやま", "ふくおか", "こうべ"}; // 福岡の選択肢
String[] SL41 = {"さが", "ふくおか", "もりおか"}; // 佐賀の選択肢
String[] SL42 = {"ながさき", "ながの", "おおつ"}; // 長崎の選択肢
String[] SL43 = {"きょうと", "くまもと", "せんだい"}; // 熊本の選択肢
String[] SL44 = {"おおいた", "やまぐち", "おおさか"}; // 大分の選択肢
String[] SL45 = {"ながさき", "ながの", "みやざき"}; // 宮崎の選択肢
String[] SL46 = {"かごしま", "あおもり", "つ"}; // 鹿児島の選択肢
String[] SL47 = {"ふくい", "こうべ", "なは"}; // 沖縄の選択肢

//名産品の選択肢
String[] SS1 = {"じゃがいも", "スイカ", "砂丘"}; // 北海道の選択肢
String[] SS2 = {"かぼす", "リンゴ", "びわ湖"}; // 青森の選択肢
String[] SS3 = {"スカイツリー", "わんこそば", "越前ガニ"}; // 岩手の選択肢
String[] SS4 = {"マンゴー", "もみじまんじゅう", "牛タン"}; // 宮城の選択肢
String[] SS5 = {"博多ラーメン", "みかん", "きりたんぽ"}; // 秋田の選択肢
String[] SS6 = {"ういろう", "お茶", "さくらんぼ"}; // 山形の選択肢
String[] SS7 = {"きたかたラーメン", "あゆ", "バームクーヘン"}; // 福島の選択肢

String[] SS8 = {"水戸納豆", "たこ焼き", "きびだんご"}; // 茨城の選択肢
String[] SS9 = {"八つ橋", "ぎょうさ", "ゴーヤ"}; // 栃木の選択肢
String[] SS10 = {"下仁田ネギ", "もみじまんじゅう", "出雲大社"}; // 群馬の選択肢
String[] SS11 = {"きりたんぽ", "わんこそば", "草加せんべい"}; // 埼玉の選択肢
String[] SS12 = {"白菜", "ちゃんぽん", "砂丘"}; // 千葉の選択肢
String[] SS13 = {"スカイツリー", "あゆ", "さくらんぼ"}; // 東京の選択肢
String[] SS14 = {"博多ラーメン", "牛タン", "かまぼこ"}; // 神奈川の選択肢

String[] SS15 = {"コシヒカリ", "たこ焼き", "砂丘"}; // 新潟の選択肢
String[] SS16 = {"白エビ", "ちゃんぽん", "バームクーヘン"}; // 富山の選択肢
String[] SS17 = {"水戸納豆", "甘エビ", "スカイツリー"}; // 石川の選択肢
String[] SS18 = {"わんこそば", "下仁田ネギ", "越前カニ"}; // 福井の選択肢
String[] SS19 = {"きたかたラーメン", "ぶどう", "八つ橋"}; // 山梨の選択肢
String[] SS20 = {"信州そば", "もみじまんじゅう", "牛タン"}; // 長野の選択肢
String[] SS21 = {"ふぐ", "わんこそば", "信州そば"}; // 岐阜の選択肢
String[] SS22 = {"お茶", "びわ湖", "草加せんべい"}; // 静岡の選択肢
String[] SS23 = {"コシヒカリ", "ういろう", "きびだんご"}; // 愛知の選択肢

String[] SS24 = {"イセエビ", "博多ラーメン", "水戸納豆"}; // 三重の選択肢
String[] SS25 = {"マンゴー", "牛タン", "びわ湖"}; // 滋賀の選択肢
String[] SS26 = {"きりたんぽ", "八つ橋", "下仁田ネギ"}; // 京都の選択肢
String[] SS27 = {"たこ焼き", "砂丘", "もみじまんじゅう"}; // 大阪の選択肢
String[] SS28 = {"きびだんご", "コシヒカリ", "バームクーヘン"}; // 兵庫の選択肢
String[] SS29 = {"草加せんべい", "大仏", "ちゃんぽん"}; // 奈良の選択肢
String[] SS30 = {"うめ", "わんこそば", "スカイツリー"}; // 和歌山の選択肢

String[] SS31 = {"砂丘", "出雲大社", "信州そば"}; // 鳥取の選択肢
String[] SS32 = {"きたかたラーメン", "ゴーヤ", "出雲大社"}; // 島根の選択肢
String[] SS33 = {"きびだんご", "もみじまんじゅう", "水戸納豆"}; // 岡山の選択肢
String[] SS34 = {"博多ラーメン", "もみじまんじゅう", "八つ橋"}; // 広島の選択肢
String[] SS35 = {"ふぐ", "下仁田ネギ", "りんご"}; // 山口の選択肢
String[] SS36 = {"スカイツリー", "ういろう", "すだち"}; // 徳島の選択肢
String[] SS37 = {"ちゃんぽん", "うどん", "わんこそば"}; // 香川の選択肢
String[] SS38 = {"コシヒカリ", "砂丘", "みかん"}; // 愛媛の選択肢
String[] SS39 = {"なす", "牛タン", "たこ焼き"}; // 高知の選択肢

String[] SS40 = {"博多ラーメン", "信州そば", "きりたんぽ"}; // 福岡の選択肢
String[] SS41 = {"きびだんご", "玉ねぎ", "砂丘"}; // 佐賀の選択肢
String[] SS42 = {"わんこそば", "下仁田ネギ", "ちゃんぽん"}; // 長崎の選択肢
String[] SS43 = {"スイカ", "たこ焼き", "もみじまんじゅう"}; // 熊本の選択肢
String[] SS44 = {"草加せんべい", "水戸納豆", "かぼす"}; // 大分の選択肢
String[] SS45 = {"びわ湖", "マンゴー", "スカイツリー"}; // 宮崎の選択肢
String[] SS46 = {"八つ橋", "黒豚", "イセエビ"}; // 鹿児島の選択肢
String[] SS47 = {"ゴーヤ", "出雲大社", "コシヒカリ"}; // 沖縄の選択肢


// 解答（問題文の順番通りの答え）
String[] A = 
  {"ほっかいどう", "あおもりけん", "いわてけん", "みやぎけん", "あきたけん", "やまがたけん", "ふくしまけん", 
  "いばらきけん", "とちぎけん", "ぐんまけん", "さいたまけん", "ちばけん", "とうきょうと", "かながわけん", 
  "にいがたけん", "とやまけん", "いしかわけん", "ふくいけん", "やまなしけん", "ながのけん", "ぎふけん", 
  "しずおかけん", "あいちけん", 
  "みえけん", "しがけん", "きょうとふ", "おおさかふ", "ひょうごけん", "ならけん", "わかやまけん", 
  "とっとりけん", "しまねけん", "おかやまけん", "ひろしまけん", "やまぐちけん", 
  "とくしまけん", "かがわけん", "えひめけん", "こうちけん", 
  "ふくおかけん", "さがけん", "ながさきけん", "くまもとけん", "おおいたけん", "みやざきけん", "かごしまけん", 
  "おきなわけん"};
  
String[] A2 = 
  {"さっぽろ", "あおもり", "もりおか", "せんだい", "あきた", "やまがた", "ふくしま",
  "みと", "うつのみや", "まえばし", "さいたま", "ちば", "とうきょう", "よこはま",
  "にいがた", "とやま", "かなざわ", "ふくい", "こうふ", "ながの", "ぎふ",
  "しずおか", "なごや",
  "つ", "おおつ", "きょうと", "おおさか", "こうべ", "なら", "わかやま",
  "とっとり", "まつえ", "おかやま", "ひろしま", "やまぐち",
  "とくしま", "たかまつ", "まつやま", "こうち",
  "ふくおか", "さが", "ながさき", "くまもと", "おおいた", "みやざき", "かごしま",
  "なは"};
  
String[] A3 = 
  {"じゃがいも", "リンゴ", "わんこそば", "牛タン", "きりたんぽ", "さくらんぼ", "きたかたラーメン", 
  "水戸納豆", "ぎょうざ", "下仁田ネギ", "草加せんべい", "白菜", "スカイツリー", "かまぼこ", 
  "コシヒカリ", "白エビ", "甘エビ", "越前カニ", "ぶどう", "信州そば", "あゆ", "お茶", "ういろう", 
  "イセエビ", "びわ湖", "八つ橋", "たこ焼き", "バウムクーヘン",   "大仏", "うめ", 
  "砂丘", "出雲大社", "きびだんご", "もみじまんじゅう", "ふぐ", 
  "すだち", "うどん", "みかん", "なす",
  "博多ラーメン","玉ねぎ","ちゃんぽん","スイカ","かぼす", "マンゴー","黒豚","ゴーヤ"};
